Revit 2024 API
FabricArea.FabricAreaType Property
 The type of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public FabricAreaType FabricAreaType { get; }
Visual Basic
Public ReadOnly Property FabricAreaType As FabricAreaType
	Get
Visual C++
public:
property FabricAreaType^ FabricAreaType {
	FabricAreaType^ get ();
}
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace